rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //    if (ret == 0x69) break;
    //    SEGGER_RTT_printf(0, "queue has %d notifications in it.\n", ++m_notifications_in_queue);
    //}

    //The above while loop should make it so we're guaranteed to queue the below
    //three notifications without encountering the NRF_RESOURCES error, however,
    //we still need to do an error check after each call to to the hvx() method.
    while (ret != NRF_SUCCESS)
    {
        ret = sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params); //acc data notification
        data_notification_error_handler(&ret);

        ret = sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params); //gyr data notification
        data_notification_error_handler(&ret);

        ret = sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params); //mag data notification
        data_notification_error_handler(&ret);
    }
}


static void characteristic_update_and_notify()
{
    if (m_use_composite_data)
    {
        characteristic_update_and_notify_composite_characteristic();
    }
    else
    {
        characteristic_update_and_notify_individual_characteristics();
    }
}

uint64_t findGCD(uint64_t a, uint64_t b)
{
    if (b == 0) return a;
    return findGCD(b, a % b);
}

uint64_t findLCM(uint64_t a, uint64_t b)
{
    return (a * b) / findGCD(a, b);
}

float findDecimalLCM(float a, float b)
{
    return findLCM(a * 1000000, b * 1000000) / 1000000.0;
}

void calculate_samples_and_connection_interval()
{
   //This method is used to select the number of samples to store in the 
   //data characteristics as a function of the current sensor ODR and desired data collection time.
   //It get's called when the application first starts, and any time the
   //ODR of the sensors is updated from the front end application.
   //We want to minimize the amount of lag that occurs with the image on screen,
   //which is accomplished by minimizing the data collection time. 
   //After some testing, 160 milliseconds seems to be a good target time for the data collection period.
   //There is a small lag seen on the screen in this case, but not really that noticeable,
   //and it allows us to collect at least a few samples at lower ODR values, which is 
   //more efficient than sending out samples 1 at a time.

   float desired_lag_time = 0.09; //in seconds.
   m_current_sensor_samples = current_sensor_odr * desired_lag_time;

   if ((float)m_current_sensor_samples == (float)(current_sensor_odr * desired_lag_time))
   {
       //We need the data collection period to be less than the connection
       //interval to ensure we get data in every single connection 
       //interval. If the data collection time evenly divides the connection
       //interval reduce the sample count by 1.
       m_current_sensor_samples--;
   }

   //The desired lag time variable above represents what we "hope" the connection 
   //interval will be. Since the connection interval is negotiated between the 
   //BLE peripheral and Central we won't actually know what the connection interval
   //is until it's set. In this method we assume that the desired lag time becomes the 
   //connection interval and set the number of samples to collect for eac notification
   //accordingly. Essentially, we want the data collection time to be as close to the 
   //lag time while still being less than it. This will ensure that new data makes it to 
   //the front end during each connection interval
   if (m_use_composite_data)
   {
       //In the case where a single characteristic is being used for each sensor, we can hold
       //MAX_SENSOR_SAMPLES worth of data in the entire characteristic, which means each 
       //individual sensor can only contribute MAX_SENSOR_SAMPLES/3 before the characteristic
       //is full.
       if (m_current_sensor_samples > (MAX_SENSOR_SAMPLES / 3))
       {
          
           //If we exceed the number of samples that will fit in the characteristic
           //we can simply split up the data between a few notifications. The fewer notifications
           //the better, and there's a cap on five notifcations. As an example, at a sensor
           //ODR of 100Hz it will take 16 samples to reach the desired lag time of 0.16 seconds.
           //Since the data collection time equals the connection interval we lower the number
           //of samples to 15 (which will instead take 0.15 seconds to collect). The maximum
           //number of samples that fit in the characteristic is 13 so what we do is split the 
           //15 data points into 3 groups of 5 data points, each of which is sent out in a 
           //different notification.
           bool found = false;
           for (int i = 2; i <= 5; i++)
           {
               if (m_current_sensor_samples % i == 0)
               {
                   m_current_sensor_samples = m_current_sensor_samples / i;
                   found = true;
                   break;
               }
           }

           //If the number of samples can't be split up into 5 notifications or
           //less then just use the full characteristic
           if (!found) m_current_sensor_samples = (MAX_SENSOR_SAMPLES / 3);
       }
   }
   else
   {
       //Unlike when using a single 
       //composite charcteristic, when using three separate characteristics the odds are lower 
       //that data from each sensor will make it to the front end in a single connection interval
       //(although it's possible to achieve multiple characteristic notifications in a single 
       //connection interval, only one is guaranteed during times of high BLE traffic). Since this
       //is the case we want to minimize the total notifications going out, so just fill each
       //characteristic to max capacity.
       if (m_current_sensor_samples > MAX_SENSOR_SAMPLES) m_current_sensor_samples = MAX_SENSOR_SAMPLES;
   }
   
   SEGGER_RTT_printf(0, "%d sensor samples have been selected.\n", m_current_sensor_samples);

   //Set the desired maximum and minimum connection interval values (which are used to negotiate
   //the interval with the central device) based on the desired lag time above. These values
   //must be multiples of 15 milliseconds with at least 15 millisecond spacing between them.
   desired_maximum_connection_interval = (int)(desired_lag_time * 1000) - ((int)(desired_lag_time * 1000) % 15); //round down to the nearst 15th millisecond
   desired_minimum_connection_interval = desired_maximum_connection_interval - 15;
}

void set_sensor_samples(int actual_connection_interval)
{
    //This method gets called after the connection interval has been changed. It's used to 
    //confirm that the number of data samples we collect in a single period is maximized.
    //It pretty much has the same logic as the calculate_samples_and_connection_interval()
    //method above, however, it uses the actual negotiated connection interval instead of 
    //the desired one.
    if (actual_connection_interval != 0) m_connection_interval = actual_connection_interval;
    int maximum_samples = current_sensor_odr * (float)m_connection_interval / 1000.0;

