rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    if ((float)maximum_samples == (float)(current_sensor_odr * (float)m_connection_interval / 1000.0))
    {
        maximum_samples--;
    }

    if (m_use_composite_data)
    {
        if (maximum_samples > (MAX_SENSOR_SAMPLES / 3))
        {
            bool found = false;
            for (int i = 2; i <= 5; i++)
            {
                if (maximum_samples % i == 0)
                {
                    maximum_samples = maximum_samples / i;
                    found = true;
                    break;
                }
            }

            if (!found) maximum_samples = (MAX_SENSOR_SAMPLES / 3);
        }
    }
    else
    {
        if (maximum_samples > MAX_SENSOR_SAMPLES) maximum_samples = MAX_SENSOR_SAMPLES;
    }

    //If the new maximum value doesn't match the value for m_current_sensor_samples
    //calculated in the calculate_samples_and_connection_interval() method, update
    //that value now.
    if (maximum_samples != m_current_sensor_samples)
    {
        m_current_sensor_samples = maximum_samples;
        SEGGER_RTT_printf(0, "Based on connection interval and ODR, sensor samples have been adjusted to %d.\n", m_current_sensor_samples);
    }
}

void data_read_handler(int measurements_taken)
{
    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values. The timer should go off SENSOR_SAMPLES times
    //every connection interval
    int offset = SAMPLE_SIZE * measurements_taken;

    if (m_use_composite_data)
    {
        //If the m_use_composite_data boolean is true then data from all three sensors is 
        //stored in a single characteristic.
        offset *= 3; //we can only fit 1/3 of the data when sharing a single characteristic
        offset += 5; //the composite data characteristic has the timestamp and number of data points variables at the front of the characteristic
        imu_comm.acc_comm.get_data(composite_characteristic_data, offset);
        imu_comm.gyr_comm.get_data(composite_characteristic_data, offset + SAMPLE_SIZE);
        imu_comm.mag_comm.get_data(composite_characteristic_data, offset + SAMPLE_SIZE + SAMPLE_SIZE);
    }
    else
    {
        //If the m_use_composite_data boolean is false then data from all each sensor is
        //stored into their own characteristics
        imu_comm.acc_comm.get_data(acc_characteristic_data, offset);
        imu_comm.gyr_comm.get_data(gyr_characteristic_data, offset);
        imu_comm.mag_comm.get_data(mag_characteristic_data, offset);
    }
}


//Functions for updating sensor power modes and settings
static void sensor_idle_mode_start()
{ 
    //In this mode, the appropriate TWI bus(es) is active and power is going to the sensors but the 
    //sensors are put into sleep mode. A red LED on the board blinks during this mode
    if (current_operating_mode == SENSOR_IDLE_MODE) return; //no need to change anything if already in idle mode

    //swap to the red LED, also make sure that the blue and green LEDs are off
    active_led = RED_LED;
    nrf_gpio_pin_set(GREEN_LED); //LEDs must be set high to turn off
    nrf_gpio_pin_set(BLUE_LED); //LEDs must be set high to turn off

    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode.
        data_timers_stop();
        
        //Put all sensors into idle mode, any of the sensors that are active
        //will be properly de-initialized
        lsm9ds1_idle_mode_enable();
        fxos8700_idle_mode_enable();
        fxas21002_idle_mode_enable();
        bmi270_idle_mode_enable(false);
        bmm150_idle_mode_enable(false);

        //the LED is deactivated during data collection so turn it back on
        led_timers_start();
    }
    else 
    {
        //If we aren't in sensor active or idle mode, it means that we arrived here from connection mode.
        //This means that both the TWI bus and sensors need to be turned on. There are two reasons why we'd
        //be turning on the sensors, either we're about to take data readings, or, we want to update the
        //sensor settings. In both cases we need to turn on the TWI bus to enable communication, but
        //before doing so we need to see if a call from the front end to use a different sensor has been made.
        uint8_t new_sensors = 0;

        if (imu_comm.sensor_model[ACC_SENSOR] != sensor_settings[ACC_START + SENSOR_MODEL])
        {
            new_sensors |= 0b001;
            default_sensors[ACC_SENSOR] = sensor_settings[ACC_START + SENSOR_MODEL];
            sensors_initialized[ACC_SENSOR] = false;
        }

        if (imu_comm.sensor_model[GYR_SENSOR] != sensor_settings[GYR_START + SENSOR_MODEL])
        {
            new_sensors |= 0b010;
            default_sensors[GYR_SENSOR] = sensor_settings[GYR_START + SENSOR_MODEL];
            sensors_initialized[GYR_SENSOR] = false;
        }
        
        if (imu_comm.sensor_model[MAG_SENSOR] != sensor_settings[MAG_START + SENSOR_MODEL])
        {
            new_sensors |= 0b100;
            default_sensors[MAG_SENSOR] = sensor_settings[MAG_START + SENSOR_MODEL];
            sensors_initialized[MAG_SENSOR] = false;
        }

        //Initialize any new sensors that need it
        if (new_sensors) sensors_init(false);

        //turn on any TWI buses that are needed by the current sensors
        enable_twi_bus(imu_comm.acc_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.gyr_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.mag_comm.twi_bus->inst_idx);
        delay_microseconds(50000); //slight delay so sensors have time to power on

        //If the BMI270 sensor is being used, it needs to be initialized by loading
        //the configuration file
        bmi270_idle_mode_enable(true);
        bmm150_idle_mode_enable(true);
    }

    current_operating_mode = SENSOR_IDLE_MODE; //set the current operating mode to idle
    SEGGER_RTT_WriteString(0, "Sensor Idle Mode engaged.\n");
}

static void sensor_active_mode_start()
{
    if (current_operating_mode != SENSOR_IDLE_MODE) return; //we can only go to active mode from idle mode

