rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //The single green LED doesn't get used due to higher current draw than the 3 RGB LEDs.
    //Make sure its GPIO pin isn't floating to reduced current leak
    nrf_gpio_pin_clear(DARK_GREEN_LED);
}

static void power_saving_init()
{
    //This method implements certain power saving techniques that I've discovered
    //with my time using the SDK

    //enable the DCDC regulators
    uint32_t err_code = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    APP_ERROR_CHECK(err_code);

    //Voltage Regulator 0 can only be enabled if the nRF52840 is being run
    //in High Voltage mode. This requires a voltage > 3.6V to be supplied to
    //the VDDH pin (which won't be the case when running from a coin cell battery).
    err_code = sd_power_dcdc0_mode_set(NRF_POWER_DCDC_ENABLE);
    APP_ERROR_CHECK(err_code);

    SEGGER_RTT_WriteString(0, "DCDC Engaged.\n");

    turn_off_mic(); //used for lowering overall power consumption (prevents GPIO pin from floating)
}

/**@brief Function for application main entry.
 */
int main(void)
 {
    bool erase_bonds;

    //Create structures for handler methods
    ble_event_handler_t ble_handlers;
    ble_handlers.gap_connected_handler = on_gap_connection_handler;
    ble_handlers.gap_disconnected_handler = on_gap_disconnection_handler;
    ble_handlers.gap_connection_interval_handler = calculate_samples_and_connection_interval;
    ble_handlers.gap_update_sensor_samples = set_sensor_samples;

    timer_handlers_t timer_handlers;
    timer_handlers.data_read_handler = data_read_handler;
    timer_handlers.error_handler = error_notification;

    //Initialize.
    log_init();
    timers_init(&active_led, &m_data_ready, &m_current_sensor_samples, &m_time_stamp, &timer_handlers);
    power_management_init();
    ble_stack_init(&ble_handlers, &m_conn_handle, &m_notification_done, &m_notifications_in_queue, &m_current_sensor_samples, &desired_minimum_connection_interval, &desired_maximum_connection_interval);
    enable_connection_event_extension();
    gatt_init();
    services_init();
    twi_init();
    sensors_init(true);
    gap_params_init(current_sensor_odr);
    advertising_init();
    conn_params_init();
    peer_manager_init();
    leds_init();
    power_saving_init();

    //Start execution.
    led_timers_start();
    advertising_start(erase_bonds);

    //Enter main loop.
    for (;;)
    {
        idle_state_handle(); //puts CPU into sleep and waits for an event signal to wake it up

        //after the CPU get's woken up (at a minimum this should happen once every
        //connection interval), see if the data ready flag has been set to true and
        //if so, send out data notifications).=
        if (m_data_ready)
        {
            //SEGGER_RTT_printf(0, "charactieristic update called at %d ticks.\n", get_current_data_time());
            characteristic_update_and_notify();
            //SEGGER_RTT_printf(0, "charactieristic update returned at %d ticks.\n", get_current_data_time());

            m_data_ready = false;
        }
    }
}